#
# Init
#

mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/homebrew

#
# Completions
#

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

#
# Prompts
#

romkatv/powerlevel10k

#
# Utils
#

mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/utility
ohmyzsh/ohmyzsh path:plugins/extract

#
# Editor
#

mattmc3/zephyr path:plugins/editor
jeffreytse/zsh-vi-mode
romkatv/zsh-no-ps2

#
# macOS
#

mattmc3/zephyr path:plugins/macos

#
# Fish-like
#

mattmc3/zephyr path:plugins/zfunctions
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
